Диплом21_августа_новый/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ВКМ_ОтпускаСотрудников</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИтогоДнейОтпуска</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Диплом21_августа_новый/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ОтпускаСотрудниковДатаНачалаПриИзменении(Элемент)
	
	РассчитатьДниОтпуска(Элементы.ОтпускаСотрудников.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДатаОкончанияПриИзменении(Элемент)
	
	РассчитатьДниОтпуска(Элементы.ОтпускаСотрудников.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьДниОтпуска(СтрокаТЧ)
	
	Если СтрокаТЧ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СтрокаТЧ.ДатаНачала) Или Не ЗначениеЗаполнено(СтрокаТЧ.ДатаОкончания) Тогда
		СтрокаТЧ.ИтогоДнейОтпуска = 0;
		Возврат;
	КонецЕсли;
	
	Если СтрокаТЧ.ДатаОкончания < СтрокаТЧ.ДатаНачала Тогда
		ПоказатьПредупреждение(, "Дата окончания не может быть раньше даты начала.");
		СтрокаТЧ.ИтогоДнейОтпуска = 0;
		Возврат;
	КонецЕсли;
	
	СтрокаТЧ.ИтогоДнейОтпуска = (СтрокаТЧ.ДатаОкончания - СтрокаТЧ.ДатаНачала) / 86400 + 1;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьАнализГрафика(Команда)
	
	АдресХранилища = ПоместитьДанныеВХранилищеНаСервере();
	
	ПараметрыФормы = Новый Структура; 
	ПараметрыФормы.Вставить("Ключ", Объект.Ссылка); 
	ПараметрыФормы.Вставить("АдресДанных", АдресХранилища);
	ПараметрыФормы.Вставить("Год", Объект.Год);
	
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.ФормаАнализГрафика", 
	ПараметрыФормы, 
	ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Функция ПоместитьДанныеВХранилищеНаСервере()
    
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтпускаСотрудников.Сотрудник КАК Сотрудник,
		|	ОтпускаСотрудников.ДатаНачала КАК ДатаНачала,
		|	ОтпускаСотрудников.ДатаОкончания КАК ДатаОкончания,
		|	ЕСТЬNULL(ОтпускаСотрудников.ИтогоДнейОтпуска, 0) КАК Дней
		|ИЗ
		|	Документ.ВКМ_ГрафикОтпусков.ОтпускаСотрудников КАК ОтпускаСотрудников
		|ГДЕ
		|	ОтпускаСотрудников.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	ТаблицаОтпусков = Запрос.Выполнить().Выгрузить();
	
	АдресДанных = ПоместитьВоВременноеХранилище(ТаблицаОтпусков, УникальныйИдентификатор);
	
	Возврат АдресДанных;
    
КонецФункции

&НаКлиенте
Процедура ГодОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	Объект.Год = Формат(ВыбранноеЗначение, "ДФ='ММММ гггг'");
КонецПроцедуры
